app/views/shared/index.html.erb

      <%# Genre List %>
        <%movie_list = Movie.all.select { |movie| movie.genre_id.include?(item.id) }%>
---
SELECT  "movies".* FROM "movies" ORDER BY "movies"."id" ASC LIMIT $1  [["LIMIT", 1]]