app/views/welcome/index.html.erb

    <a class="card" href="/cities" >
        <img src=<%= City.all.sample.thumbnail%> height="200" width="100%" >
---
SELECT "cities".* FROM "cities"

    <a class="card" href="/movietheatres" >
        <img src=<%= MovieTheatre.all.sample.thumbnail%> height="200" >
---
SELECT "movie_theatres".* FROM "movie_theatres"

    <a class="card" href="/movies" >
        <img src=<%= Movie.all.sample.poster%> height="200" >
---
SELECT "movies".* FROM "movies"